In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({"Company": ["Google", "Facebook", "Google", "Microsoft", "Microsoft", "Oracle"], 
                  "Name": ["Dwight", "Michael", "Erin", "Jim", "Toby", "Mose"],
                  "Sales": [1000, 700, 50, 900, 100, 500]})

In [4]:
df

     Company     Name  Sales
0     Google   Dwight   1000
1   Facebook  Michael    700
2     Google     Erin     50
3  Microsoft      Jim    900
4  Microsoft     Toby    100
5     Oracle     Mose    500

In [6]:
comp = df.groupby("Company")

In [7]:
comp.mean()

           Sales
Company
Facebook     700
Google       525
Microsoft    500
Oracle       500

In [9]:
df.groupby("Company").mean()

           Sales
Company
Facebook     700
Google       525
Microsoft    500
Oracle       500

In [11]:
df.groupby("Company").std()
#standard deviation

                Sales
Company
Facebook          NaN
Google     671.751442
Microsoft  565.685425
Oracle            NaN

In [13]:
df.groupby("Sales").min()

         Company     Name
Sales
50        Google     Erin
100    Microsoft     Toby
500       Oracle     Mose
700     Facebook  Michael
900    Microsoft      Jim
1000      Google   Dwight

In [16]:
df.groupby("Company").count()

           Name  Sales
Company
Facebook      1      1
Google        2      2
Microsoft     2      2
Oracle        1      1

In [17]:
comp = df.groupby("Company")

In [18]:
comp.describe()

          Sales
          count   mean         std    min    25%    50%    75%     max
Company
Facebook    1.0  700.0         NaN  700.0  700.0  700.0  700.0   700.0
Google      2.0  525.0  671.751442   50.0  287.5  525.0  762.5  1000.0
Microsoft   2.0  500.0  565.685425  100.0  300.0  500.0  700.0   900.0
Oracle      1.0  500.0         NaN  500.0  500.0  500.0  500.0   500.0

In [22]:
comp.describe().transpose()["Google"]
#transpose because you can't use the describe() function on a row.

Sales  count       2.000000
       mean      525.000000
       std       671.751442
       min        50.000000
       25%       287.500000
       50%       525.000000
       75%       762.500000
       max      1000.000000
Name: Google, dtype: float64